In [80]:
import psycopg2

In [81]:
conn = psycopg2.connect('dbname=connoranderson')

In [82]:
curr = conn.cursor()

In [83]:
query = """
SELECT * FROM kitten;
"""

# Easier to define the query as a variable and pass that variable in

In [84]:
curr.execute(query)

In [85]:
import pandas as pd

In [86]:
data = curr.fetchall()
data

[(1, 'john', 'taby', 'orange'),
 (2, 'jake', 'tiger', 'brown'),
 (3, 'Barry', 'Lion', 'Golden'),
 (4, 'Simba', 'Panther', 'JET BLACK'),
 (5, 'Zzuzzy', 'Ragdoll', 'Cloud White')]

In [87]:
df = pd.DataFrame(data)

In [88]:
df

   0       1        2            3
0  1    john     taby       orange
1  2    jake    tiger        brown
2  3   Barry     Lion       Golden
3  4   Simba  Panther    JET BLACK
4  5  Zzuzzy  Ragdoll  Cloud White

In [89]:
df1 = pd.read_sql('SELECT * FROM kitten', con=conn)
df1

   id    name    breed        color
0   1    john     taby       orange
1   2    jake    tiger        brown
2   3   Barry     Lion       Golden
3   4   Simba  Panther    JET BLACK
4   5  Zzuzzy  Ragdoll  Cloud White

In [90]:
curr.description

(Column(name='id', type_code=23),
 Column(name='name', type_code=25),
 Column(name='breed', type_code=25),
 Column(name='color', type_code=25))

In [91]:
# columns = [col.name for col in curr.description]

# pd.DataFrame(data, columns=columns)

In [93]:
columns = ['name', 'breed', 'color']

In [105]:
query = f"""
SELECT {', '.join(columns)}
FROM kitten
WHERE breed = 'Ragdoll';"""

In [106]:
curr.execute(query)
data = curr.fetchall()
df2 = pd.DataFrame(data, columns=columns)
df2

     name    breed        color
0  Zzuzzy  Ragdoll  Cloud White